{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "char_input_normal", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 52], "dtype": "float32", "sparse": false, "name": "char_input_normal"}, "inbound_nodes": []}, {"name": "char_input_caseless", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 52], "dtype": "float32", "sparse": false, "name": "char_input_caseless"}, "inbound_nodes": []}, {"name": "char_embedding1", "class_name": "TimeDistributed", "config": {"name": "char_embedding1", "trainable": true, "layer": {"class_name": "Embedding", "config": {"name": "embedding_3", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 95, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.5, "maxval": 0.5, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}}, "inbound_nodes": [[["char_input_normal", 0, 0, {}]]]}, {"name": "char_embedding2", "class_name": "TimeDistributed", "config": {"name": "char_embedding2", "trainable": true, "layer": {"class_name": "Embedding", "config": {"name": "embedding_4", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 69, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.5, "maxval": 0.5, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}}, "inbound_nodes": [[["char_input_caseless", 0, 0, {}]]]}, {"name": "words_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "int32", "sparse": false, "name": "words_input"}, "inbound_nodes": []}, {"name": "pos_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "int32", "sparse": false, "name": "pos_input"}, "inbound_nodes": []}, {"name": "char_LSTM1", "class_name": "TimeDistributed", "config": {"name": "char_LSTM1", "trainable": true, "layer": {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 25, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.25, "implementation": 1}}, "merge_mode": "concat"}}}, "inbound_nodes": [[["char_embedding1", 0, 0, {}]]]}, {"name": "char_LSTM2", "class_name": "TimeDistributed", "config": {"name": "char_LSTM2", "trainable": true, "layer": {"class_name": "Bidirectional", "config": {"name": "bidirectional_2", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 25, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.25, "implementation": 1}}, "merge_mode": "concat"}}}, "inbound_nodes": [[["char_embedding2", 0, 0, {}]]]}, {"name": "words_elmo_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "string", "sparse": false, "name": "words_elmo_input"}, "inbound_nodes": []}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "trainable": false, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 7760, "output_dim": 200, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["words_input", 0, 0, {}]]]}, {"name": "embedding_2", "class_name": "Embedding", "config": {"name": "embedding_2", "trainable": false, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 45, "output_dim": 45, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["pos_input", 0, 0, {}]]]}, {"name": "average_1", "class_name": "Average", "config": {"name": "average_1", "trainable": true}, "inbound_nodes": [[["char_LSTM1", 0, 0, {}], ["char_LSTM2", 0, 0, {}]]]}, {"name": "elmo_embedding_layer_1", "class_name": "ElmoEmbeddingLayer", "config": {"name": "elmo_embedding_layer_1", "trainable": true}, "inbound_nodes": [[["words_elmo_input", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["embedding_1", 0, 0, {}], ["embedding_2", 0, 0, {}], ["average_1", 0, 0, {}], ["elmo_embedding_layer_1", 0, 0, {}]]]}, {"name": "word_LSTM", "class_name": "Bidirectional", "config": {"name": "word_LSTM", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 60, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.25, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "fully_connected1", "class_name": "TimeDistributed", "config": {"name": "fully_connected1", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["word_LSTM", 0, 0, {}]]]}, {"name": "CRF_layer", "class_name": "CRF", "config": {"name": "CRF_layer", "trainable": true, "units": 3, "learn_mode": "join", "test_mode": "viterbi", "use_boundary": true, "use_bias": true, "sparse_target": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "chain_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "boundary_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": null, "chain_regularizer": null, "boundary_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "chain_constraint": null, "boundary_constraint": null, "bias_constraint": null, "input_dim": 50, "unroll": false}, "inbound_nodes": [[["fully_connected1", 0, 0, {}]]]}], "input_layers": [["words_input", 0, 0], ["char_input_normal", 0, 0], ["char_input_caseless", 0, 0], ["pos_input", 0, 0], ["words_elmo_input", 0, 0]], "output_layers": [["CRF_layer", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}